
import '../assets/css/article_sub.css'
import { useParams } from 'react-router-dom';

const artSub = [
    {
        id: 1,
        src1: './src/assets/img/art1.jpeg',
        src2: './src/assets/img/pp1.jpeg',
        title: 'آیا پروتئین وی باعث ریزش مو می‌شود',
        title2: 'ریزش مو و دلایل آن',
        title3: 'سابقه خانوادگی (وراثت)',
        title4: 'تغییرات هورمونی و شرایط پزشکی',
        title5: 'داروها و مکمل‌ها و پرتودرمانی سر',
        title6: 'جمع‌بندی',
        text1: 'این سوال که آیا پروتئین وی باعث ریزش مو می‌شود موضوعی است که در بین علاقه‌مندان به سلامت و تناسب اندام مورد بحث است. ریزش مو می‌تواند ناشی از عواملی مانند ژنتیک، عدم تعادل هورمونی و برخی شرایط پزشکی باشد. درحالی‌که احتمالا مصرف بیش از حد پروتئین وی به‌طور بالقوه به ریزش مو کمک کند، تحقیقات بیشتری برای درک تاثیر پروتئین وی در ریزش مو نیاز است. با این‌حال، قبل از مصرف مهم است که با پزشک مشورت شود.',
        text2: 'افراد معمولا روزانه 50 تا 100 تار مو از دست می‌دهند که چندان قابل توجه نیست؛ زیرا موهای جدید همزمان درحال رشد هستند. اگر موی جدید به‌ جای موی ریخته‌شده رشد نکند، مو دچار ریزش شده است. ریزش مو عموما به به یک یا چند دلیل زیر مربوط می‌شود:',
        text3: 'شایع‌ترین دلیل ریزش مو ارثی است که به دلیل بالا رفتن سن پیش می‌آید. این بیماری آلوپسی آندروژنیک نامیده می‌شود. این ریزش معمولا به تدریج و با الگوهای قابل پیش بینی رخ می‌دهد؛ عقب نشینی خط مو و لکه‌های طاس در مردان و نازک شدن موها در امتداد تاج سر در زنان. در این مورد تاثیر پروتئین وی در ریزش مو چندان قابل توجه نیست.',
        text4: 'شرایط مختلفی منجر به ریزش موی همیشگی یا موقت می‌شود، مانند تغییرات در هورمون‌ها در دوران حاملگی، زایمان، یائسگی و بیماری تیروئید. بیماری‌های پزشکی شامل آلوپسی آره‌آتا است که مربوط به سیستم ایمنی است و باعث ریزش موی تکه‌ای، عفونت‌های پوست سر مانند کرم حلقه‌ای و یک اختلال به نام تریکوتیلومانیا می‌شود.',
        text5: 'در کنار تاثیر پروتئین وی در ریزش مو، داروها نیز ممکن است با عارضه‌ ریزش مو همراه باشند. مثل داروهایی که برای سرطان، آرتریت، افسردگی، مشکلات قلبی، نقرس و فشار خون بالا استفاده می‌شود. همچنین در پرتودرمانی به سر نیز ممکن است موها مثل قبل رشد نکنند.',
        text6: 'تاثیر پروتئین وی در ریزش مو در دوزهای بالای آن بیشتر است؛ هرچند شواهد علمی کافی وجود ندارد. با گنجاندن مکمل ورزشی مناسب و تمرکز بر سلامت و تندرستی، می‌توانید همزمان با دنبال کردن اهداف بدنسازی خود، از ریزش مو نیز جلوگیری کنید. قبل از شروع هر رژیم مکمل مانند پروتئین وی با یک متخصص مشورت کنید تا مطمئن شوید که برای شما ایمن و موثر است.'
    },
    {
        id: 2,
        src1: './src/assets/img/art4.jpeg',
        src2: './src/assets/img/pp2.jpeg',
        title: 'آیا پودر پروتئین باعث چاقی می شود؟',
        title2: 'تأثیر پودر پروتئین بر بدن',
        title3: 'افزایش رشد عضلات',
        title4: 'کاهش آسیب عضلانی',
        title5: 'حفظ توده عضلانی',
        title6: 'تأمین پروتئین مورد نیاز بدن',
        text1: 'طی سال‌های گذشته علاقه به حفظ تناسب اندام و سلامت جسمانی در جوامع مدرن، باعث افزایش توجه به اصول تغذیه صحیح و مصرف مکمل ورزشی شده است. یکی از مکمل‌های محبوب بین ورزشکاران، انواع پودرهای پروتئینی بوده و از جمله ادعاهایی که در این زمینه مطرح شده این است که مصرف پودر پروتئین می‌تواند باعث چاقی شود. در این مقاله از سایت داروخانه صبا، به بررسی این ادعا می‌پردازیم و تأثیر پودر پروتئین برای چاقی را مورد بررسی قرار می‌دهیم. لطفاً تا پایان با ما همراه باشید و نظرات خود را با ما و سایر مخاطبین به اشتراک بگذارید.',
        text2: 'پودر پروتئین یک مکمل محبوب بین ورزشکاران و افرادی است که به تقویت عضلات و بهبود سلامت عمومی بدن خود علاقه‌مند هستند. این محصول که به صورت پودری عرضه شده و معمولاً از منابع مختلف مانند سویا، شیر، آب پنیر و … تهیه می‌شود، حاوی پروتئین‌های مختلف است و نقش مهمی در تقویت عضلات بدن انسان دارد. در ادامه به بررسی برخی از تأثیرات پودر پروتئین برای چاقی و بدن انسان می‌پردازیم:',
        text3: 'پودر پروتئین، به دلیل برخورداری از پروتئین‌های باکیفیت، می‌تواند موجب افزایش حجم و تقویت عضلات شود. این پودر زمانی که بعد از تمرینات ورزشی مصرف ‌شود، به عضلات کمک می‌کند تا سریع‌تر بازسازی شده و بهبود یابند. این موضوع می‌تواند کارایی تمرینات ورزشی را افزایش داده و عملکرد ورزشکاران را بهبود بخشد. همچنین میتوانید با مراجعه به مقاله بهترین مکمل‌های ورزشی برای افزایش وزن و حجم دهی اطلاعات جامع‌تری کسب کنید.',
        text4: 'مصرف پودر پروتئین پس از تمرینات ورزشی، می‌تواند به کاهش آسیب‌های عضلانی کمک کند. این محصول می‌تواند فرآیند بازسازی عضلات را تسریع و از آسیب‌های ناشی از تمرینات پرفشار جلوگیری کند.',
        text5: 'پودر پروتئین می‌تواند در حفظ توده عضلانی بدن موثر باشد. ورزشکاران و افرادی که در رژیم‌های کاهش وزن هستند، ممکن است در معرض از دست دادن توده عضلانی باشند. با مصرف منظم پروتئین، می‌توان از کاهش توده عضلانی در رژیم‌های سنگین جلوگیری و وضعیت بدن را به خوبی حفظ کرد.',
        text6: 'مصرف پودر پروتئین می‌تواند به تأمین پروتئین‌های مورد نیاز بدن کمک کند. برخی از افراد ممکن است به دلیل شرایط خاص مانند بیماری‌ یا رژیم‌های غذایی محدود، نیاز به مقدار بیشتری پروتئین داشته باشند. مصرف پودر پروتئین در این موارد می‌تواند به عنوان یک منبع غذایی مفید عمل کند.'
    },
    {
        id: 3,
        src1: './src/assets/img/art3.jpeg',
        src2: './src/assets/img/pp4.jpg',
        title: 'بهترین مکمل های گینر برای افزایش وزن',
        title2: 'معرفی بهترین برند گینر برای افزایش وزن',
        title3: '1- کارن',
        title4: '2- دوبیس',
        title5: '3- ژن استار',
        title6: 'سخن پایانی',
        text1: 'آیا شما هم جزو آن دسته از افرادی هستید که از تلاش دائم برای رسیدن به وزن ایده‌آل خود و نرسیدن به آن خسته شده‌اید؟ هر رژیم غذایی، ورزش و سایر روش‌های خارق‌العاده را امتحان کرده‌اید اما باز هم به نتیجه نرسیده‌اید؟ یک راه‌حل ساده برای مشکل شما وجود دارد و آن هم استفاده از بهترین گینر افزایش وزن و حجم است. گینر (Gainer) نوعی مکمل غذایی است که برای کمک به افراد برای افزایش کالری دریافتی و افزایش وزن مورد استفاده قرار می‌گیرد. این محصول به ویژه در میان افرادی که تنها از طریق رژیم غذایی منظم و ورزش نمی‌توانند وزن اضافه کنند یا عضله بسازند، محبوبیت بالایی دارد. معمولاً ورزشکاران، بدنسازان و علاقه‌مندان به تناسب اندام از گینر کمک می‌گیرند تا حجم عضلانی را به بدن خود اضافه کنند. در این مقاله با ما همراه باشید تا بررسی کنیم که خرید گینر خارجی چگونه به افزایش وزن سالم کمک می‌کند و کدام برندها در بازار معتبرتر و پرفروش‌تر هستند.',
        text2: 'اگر سال‌ها است که بدنسازی کار کرده‌اید یا با مکمل‌های بدنسازی از قبل آشنایی دارید، احتمالاً می‌دانید که برندهای مشهور و بسیار پرفروش دنیا، امروزه دیگر در بازار ایران پیدا نمی‌شوند. از این رو و با توجه به قیمت بالای دلار، بسیاری از افراد ترجیح می‌دهند گینرهای ایرانی را خریداری کنند که کیفیت مشابه اما قیمت مناسب‌تری دارند. در ادامه به معرفی سه برند تولیدکننده بهترین گینر افزایش وزن و حجم می‌پردازیم که در بازار ایران طرفداران زیادی پیدا کرده‌اند:‌',
        text3: 'این شرکت یکی از تولیدکنندگان باسابقه انواع مکمل‌های دارویی، غذایی، ورزشی و فرمولاهای انترال به شمار می‌رود که محصولات آن بین مصرف‌کنندگان از محبوبیت بالایی برخوردارند. شرکت کارن با بیش از ۲۰ سال تجربه، یکی از پیشرفته‌ترین و بزرگ‌ترین شرکت‌های تولید دارو در خاورمیانه به ویژه در زمینه تولید سافت ژل‌ها است. این شرکت مواد مصرفی خود را از کشورهای دیگر وارد کرده و در ایران بسته‌بندی و توزیع می‌کند، به همین دلیل مورد پسند افرادی واقع شده است که به دنبال یک مکمل گینر با کیفیت بالا و قیمت مناسب می‌گردند',
        text4: 'شرکت صنایع غذایی ایلیا پارس که با نام دوبیس شناخته می‌شود، یکی دیگر از برندهای مطرح ایرانی در زمینه تولید بهترین گینر افزایش وزن و حجم و انواع مکمل‌های دارویی به شمار می‌رود. این شرکت با بیش از ۱۰ سال سابقه و استفاده از دستگاه‌های تولید و بسته‌بندی مدرن، توانسته محبوبیت زیادی میان ورزشکاران و علاقه‌مندان به تناسب اندام به دست آورد. محصولات برند دوبیس در اکثر داروخانه آنلاین و وبسایت‌های اینترنتی یافت می‌شوند و تمامی استانداردها و گواهینامه‌های لازم از جمله ISO 22000، ISO 9001 و غیره را دارد.',
        text5: 'شرکت ژن استار که در زمینه تولید مکمل‌های ورزشی و غذایی فعالیت دارد، یکی دیگر از برندهای مطرح در بازار ایران به شمار می‌رود. این شرکت دارای بخش تحقیق و توسعه بسیار قوی بوده و جهت فرموله کردن محصولات جدید خود از بهترین داروسازان داخلی و خارجی کمک می‌گیرد. تمامی محصولات ژن استار بر پایه استانداردهای GMP تولید می‌شوند و مجوزهای مهمی مانند HACCP، ISO 22000، ISO 9001 و غیره را دارد.',
        text6: 'بهترین گینر افزایش وزن و حجم نوشیدنی معجزه‌گری است که می‌تواند به شما در تنظیم وزن به روشی سالم کمک کند. این محصولات با دقت بالا و مواد مغذی ساخته شده‌اند که بدن شما به آن‌ها نیاز دارد. مکمل‌های گینر می‌توانند برای افزایش کالری دریافتی و افزایش وزن به شکلی سالم بسیار مفید واقع شوند؛ اما به یاد داشته باشید که در کنار استفاده از گینر، باید یک رژیم غذایی متعادل و کامل را حفظ کنید. همچنین باید تمرینات خاصی تحت نظر مربی انجام دهید تا به اهداف خود دست یابید. با رویکرد درست، می‌توانید بدن خود را سالم‌تر و قوی‌تر سازید.'
    },
    {
        id: 4,
        src1: './src/assets/img/art4.jpeg',
        src2: './src/assets/img/pp2.jpeg',
        title: 'آیا پودر پروتئین باعث چاقی می شود؟',
        title2: 'تأثیر پودر پروتئین بر بدن',
        title3: 'افزایش رشد عضلات',
        title4: 'کاهش آسیب عضلانی',
        title5: 'حفظ توده عضلانی',
        title6: 'تأمین پروتئین مورد نیاز بدن',
        text1: 'طی سال‌های گذشته علاقه به حفظ تناسب اندام و سلامت جسمانی در جوامع مدرن، باعث افزایش توجه به اصول تغذیه صحیح و مصرف مکمل ورزشی شده است. یکی از مکمل‌های محبوب بین ورزشکاران، انواع پودرهای پروتئینی بوده و از جمله ادعاهایی که در این زمینه مطرح شده این است که مصرف پودر پروتئین می‌تواند باعث چاقی شود. در این مقاله از سایت داروخانه صبا، به بررسی این ادعا می‌پردازیم و تأثیر پودر پروتئین برای چاقی را مورد بررسی قرار می‌دهیم. لطفاً تا پایان با ما همراه باشید و نظرات خود را با ما و سایر مخاطبین به اشتراک بگذارید.',
        text2: 'پودر پروتئین یک مکمل محبوب بین ورزشکاران و افرادی است که به تقویت عضلات و بهبود سلامت عمومی بدن خود علاقه‌مند هستند. این محصول که به صورت پودری عرضه شده و معمولاً از منابع مختلف مانند سویا، شیر، آب پنیر و … تهیه می‌شود، حاوی پروتئین‌های مختلف است و نقش مهمی در تقویت عضلات بدن انسان دارد. در ادامه به بررسی برخی از تأثیرات پودر پروتئین برای چاقی و بدن انسان می‌پردازیم:',
        text3: 'پودر پروتئین، به دلیل برخورداری از پروتئین‌های باکیفیت، می‌تواند موجب افزایش حجم و تقویت عضلات شود. این پودر زمانی که بعد از تمرینات ورزشی مصرف ‌شود، به عضلات کمک می‌کند تا سریع‌تر بازسازی شده و بهبود یابند. این موضوع می‌تواند کارایی تمرینات ورزشی را افزایش داده و عملکرد ورزشکاران را بهبود بخشد. همچنین میتوانید با مراجعه به مقاله بهترین مکمل‌های ورزشی برای افزایش وزن و حجم دهی اطلاعات جامع‌تری کسب کنید.',
        text4: 'مصرف پودر پروتئین پس از تمرینات ورزشی، می‌تواند به کاهش آسیب‌های عضلانی کمک کند. این محصول می‌تواند فرآیند بازسازی عضلات را تسریع و از آسیب‌های ناشی از تمرینات پرفشار جلوگیری کند.',
        text5: 'پودر پروتئین می‌تواند در حفظ توده عضلانی بدن موثر باشد. ورزشکاران و افرادی که در رژیم‌های کاهش وزن هستند، ممکن است در معرض از دست دادن توده عضلانی باشند. با مصرف منظم پروتئین، می‌توان از کاهش توده عضلانی در رژیم‌های سنگین جلوگیری و وضعیت بدن را به خوبی حفظ کرد.',
        text6: 'مصرف پودر پروتئین می‌تواند به تأمین پروتئین‌های مورد نیاز بدن کمک کند. برخی از افراد ممکن است به دلیل شرایط خاص مانند بیماری‌ یا رژیم‌های غذایی محدود، نیاز به مقدار بیشتری پروتئین داشته باشند. مصرف پودر پروتئین در این موارد می‌تواند به عنوان یک منبع غذایی مفید عمل کند.'
    },
    {
        id: 5,
        src1: './src/assets/img/art5.jpeg',
        src2: './src/assets/img/pp3.jpg',
        title: 'بهترین برندهای کرم ضد آفتاب',
        title2: 'ویژگی‌های یک ضدآفتاب خوب',
        title3: 'معرفی 5 برند محبوب ضدآفتاب ایرانی',
        title4: 'کرم ضد آفتاب بی رنگ ژیناژن مناسب برای پوست چرب و مختلط با SPF50',
        title5: 'فلوئید ضد آفتاب و روشن کننده سیسپرسا با SPF50+',
        title6: 'سخن پایانی',
        text1: 'آیا بدون استفاده از ضد آفتاب می‌توان پوستی صاف، شفاف و بدون کک و مک داشت؟ پاسخ این سوال قطعاً منفی است. اگر می‌خواهید از خود در برابر سرطان پوست محافظت کنید و پوستی صاف و شفاف داشته باشید، استفاده از کرم ضد آفتاب برای شما ضروری و مهم است. در نتیجه در این مقاله تصمیم گرفتیم بهترین برند ضد آفتاب را به شما معرفی کنیم. در هنگام خرید این محصول مراقبت از پوست باید به یک سری نکات توجه داشته باشید تا بهترین ضد آفتاب را برای پوست خود انتخاب کنید. در ادامه این مقاله با ما همراه باشید تا بهترین ضدآفتاب‌های مناسب برای هر نوع پوستی را با هم بررسی کنیم.',
        text2: 'اولین سوالی که از خود می‌پرسید احتمالاً این است که اصلاً چرا باید از ضد آفتاب استفاده کنیم؟ در پاسخ باید گفت پوستی صاف و شفاف حاصل استفاده مداوم از ضدآفتاب است. در مرحله اول استفاده از کرم ضد آفتاب بر اساس spf مناسب برای پوست شما مهم است. پس از تهیه این محصول می‌توانید به سراغ سایر کرم‌های آرایشی بروید. اما چگونه می‌توانیم یک ضد آفتاب خوب تهیه کنیم؟ یک ضد آفتاب خوب چه ویژگی‌هایی دارد؟ اولین قدم بررسی SPF ضد آفتاب است. SPF مخفف Sun Protection Factor به معنای فاکتورهای محافظت در برابر آفتاب است. هر چه مقدار این فاکتور بیشتر باشد، مدت زمان بیشتری می‌توانید در فضای باز که دارای نور شدید خورشید است بمانید. به یاد داشته باشید، قبل از استفاده از ضد آفتاب، نوع SPF ذکر شده روی جعبه را مطالعه کنید. ضد آفتاب‌ها برای محافظت از پوست در برابر اشعه UVA یا UVB یا هر دو طراحی شده‌اند. اشعه مضر فرابنفش توانایی آسیب رساندن به پوست را دارد. UVA اشعه‌ای است که منجر به چین و چروک و پیری پوست می‌شود. UVB همچنین باعث قرمزی، خارش و سوزش پوست خواهد شد؛ بنابراین، یک ضد آفتاب کامل، ضد آفتابی است که از پوست در برابر این دو عامل محافظت می‌کند. ضد آفتاب‌ها برای محافظت از پوست در برابر اشعه UVA یا UVB یا هر دو طراحی شده‌اند. اشعه مضر فرابنفش توانایی آسیب رساندن به پوست را دارد. UVA اشعه‌ای است که منجر به چین و چروک و پیری پوست می‌شود. UVB همچنین باعث قرمزی، خارش و سوزش پوست خواهد شد؛ بنابراین، یک ضد آفتاب کامل، ضد آفتابی   است که از پوست در برابر این دو عامل محافظت می‌کند. یکی دیگر از فاکتورهایی که هنگام خرید یک کرم ضد آفتاب خوب باید در نظر بگیرید، مناسب بودن آن کرم با توجه به نوع پوست شما است. البته یک ضدآفتاب خوب علاوه بر داشتن SPF خوب و مناسب با نوع پوست، باید ویژگی‌های دیگری نیز داشته باشد که شامل موارد زیر هستند: مقاوم بودن در برابر آب، مقاومت در برابر عرق ، ماندگاری بالا',
        text3: 'در ادامه قصد داریم ۵ برند مطرح و محبوب ضدآفتاب ایرانی را به شما معرفی کنیم: کرم ضد آفتاب بی رنگ ژیناژن مناسب برای پوست چرب و مختلط با SPF50 غیر کومدون زا بوده و منافذ پوست را مسدود نمی‌کند. اگر پوست شما مستعد آکنه است، این ضد آفتاب با فرمول سبک و بدون چربی به راحتی جذب پوست می‌شود و گزینه بسیار مناسبی برای زیر آرایش و استفاده روزانه خواهد بود. این محصول حاوی ویتامین E و B5 است و به آبرسانی و رطوبت رسانی به پوست کمک می‌کند. ویژگی‌های کرم ضد آفتاب بی رنگ ژیناژن مناسب برای پوست چرب و مختلط به شرح زیر است:  از پوست در برابر اشعه‌های مضر خورشید محافظت می‌کند. ، از پوست در برابر رادیکال‌های آزاد مراقبت می‌کند. ، از بسته شدن منافذ پوست جلوگیری می‌کند.',
        text4: 'ضد آفتاب و مایع روشن کننده سیسپرسا SPF50 وظیفه محافظت از پوست در برابر اشعه‌های مضر خورشید را بر عهده دارد. همان‌طور که می‌دانید اشعه‌های UVA و UVB خورشید به لایه‌های عمیق پوست نفوذ کرده و خطر ابتلا به سرطان را به میزان قابل توجهی افزایش می‌دهد. این اشعه‌ها ساختار کلاژن را تخریب کرده و روند پیری پوست را تسریع می‌کنند. خوشبختانه این ضد آفتاب حاوی به‌روزترین فیلترهای محافظ در برابر اشعه خورشید است. همچنین این محصول تیرگی پوست را از بین می‌برد و لک‌ها را محو می‌کند. یکی از ویژگی‌های بارز این ضد آفتاب، مقابله با رادیکال‌های آزاد و از بین بردن اثرات مخرب آن‌ها است. این مایع بسیار سبک است و به سرعت جذب پوست می‌شود. استفاده از مایع ضد آفتاب سیسپرسا برای همه افراد به‌خصوص افراد دارای لک توصیه می‌شود. ترکیبات فلوئید ضد آفتاب و روشن کننده سیسپرسا با SPF50+ حاوی ویتامین C، نیاسینامید و فیلترهای ضد آفتاب است. ویتامین C موجود در این محصول مشکلات پوستی ناشی از آفتاب سوختگی را درمان کرده و از ایجاد چین و چروک روی پوست جلوگیری می‌کند. این ویتامین رنگ پوست را یکدست کرده، خاصیت ارتجاعی پوست را افزایش می‌دهد و زخم‌های پوستی را درمان می‌کند. نیاسینامید یا ویتامین B3 نیز خاصیت ضد پیری دارد و باعث افزایش تولید کلاژن در پوست می‌شود. نیاسینامید تیرگی را از بین می‌برد و رنگ پوست را روشن می‌کند. جلوگیری از تبخیر رطوبت در سلول‌های پوست، درمان آکنه، کنترل ترشح سبوم و کمک به کاهش علائم روزاسه و پسوریازیس از دیگر فواید ویتامین B3 برای پوست است.',
        text5: 'ضد آفتاب بدون چربی SPF50 برای پوست‌های مختلط تا چرب مناسب بوده و غیر کومدون زا است. این ضد آفتاب محافظت بسیار خوبی در برابر اشعه‌های UV، مادون قرمز، آبی و نور مرئی دارد. این محصول با ساختار سبک و بدون چربی خود به سرعت جذب می‌شود. خوشبختانه پس از جذب، پوست را بدون برجای گذاشتن اثر سفیدی یکدست می‌کند. لازم به ذکر است که ترکیب سبورداکتیل به کار رفته در این ضد آفتاب بدون چربی به حفظ رطوبت طبیعی پوست کمک می‌کند. همچنین در کنترل ترشح چربی و تجمع منافذ باز پوست نقش دارد. فلوئید ضد آفتاب بی رنگ اسکین وان مناسب برای پوست مختلط و چرب با SPF50+ همچنین یک کرم ضد چروک است و می‌تواند چربی‌های اضافی پوست را جذب کند. علاوه بر این، با کمک به کلاژن سازی بیشتر پوست، خاصیت ارتجاعی و استقامت پوست را افزایش می‌دهد.',
        text6: 'امروزه با توجه به آسیب لایه اوزون، باید به سلامت و مراقبت از پوست صورت توجه بیشتری داشته باشیم. با توجه به اینکه 80 درصد پیری پوست به دلیل قرار گرفتن در معرض اشعه ماوراءبنفش است، برای جلوگیری از این آسیب و کاهش چین و چروک باید از ضد آفتاب اصل و باکیفیت استفاده کنیم. در این مقاله سعی کردیم بهترین ضد آفتاب‌های مناسب برای هر نوع پوستی را به شما معرفی کنیم. ما این محصولات آفتاب را با قیمت‌های متفاوت معرفی کردیم تا خرید و استفاده برای شما راحت‌تر باشد. آیا تجربه استفاده از این ضد آفتاب‌ها را دارید؟ کدام ضد آفتاب را مناسب می‌دانید؟ اگر تجربه‌ای در این زمینه دارید، در قسمت نظرات با ما در میان بگذارید.'
    },
    {
        id: 6,
        src1: './src/assets/img/art6.jpeg',
        src2: './src/assets/img/badan1.jpeg',
        title: 'معرفی بهترین پروتئین وی ایزوله خارجی',
        title2: 'بهترین پروتئین وی ایزوله برای حجم',
        title3: ' پودر پروتئین وی ایزوله 100 درصد تریم لایف',
        title4: 'پودر وی پروتئین ایزوله 100 درصد استلا نوتریشن',
        title5: 'پودر پروتئین وی ایزوله گلد رانتک 2270 گرمی',
        title6: 'بهترین پروتئین وی ایزوله برای بانوان',
        title6: 'سخن پایانی',
        text1: 'در دنیای پرمشغله امروز، افراد به دنبال راه‌هایی برای ارتقای سلامت و تناسب‌اندام خود به روشی کارآمد هستند. مکمل‌های پروتئینی، به‌ویژه پروتئین وی ایزوله، به دلیل نقش مؤثری که در رشد عضلات، ترمیم و ریکاوری دارد، به انتخابی محبوب تبدیل شده‌ است. بااین‌حال، با تنوع گسترده برندها و محصولات موجود در بازار، انتخاب بهترین پروتئین وی ایزوله خارجی می‌تواند دلهره‌آور باشد. ازاین‌رو در این بخش به معرفی گزینه‌های مختلف و بررسی بهترین نمونه‌ها می‌پردازیم. به‌عنوان‌مثال، پودر وی پروتئین 100% کاله پرو 1800 گرمی یک گزینه عالی برای خرید است.',
        text2: 'حال که به طور کامل با پروتئین وی آشنا شدید، در این بخش قصد داریم بهترین پروتئین وی ایزوله خارجی که برای حجم مصرف می‌شود را معرفی کنیم.',
        text3: 'هترین پودر پروتئین وی برای حجم را می‌توان پودر پروتئین وی 100 درصد تریم لایف دانست. این پودر علاوه بر کمک به عضله‌سازی، هضم و جذب سریعی دارد. پروتئین مورد استفاده در این محصول از نوع کنسانتره است و حاوی آمینو اسیدهای ضروری و غیرضروری برای بدن است. با مصرف روزانه 1 اسکوپ این پودر به‌همراه مایه‌هایی مانند آب، شیر کم چرب یا آبمیوه، می‌توان به بازسازی سریع ماهیچه‌ها و بافت‌های بدن کمک کرد و نتایج مطلوبی را به دست آورد',
        text4: 'در جستجوی بهترین پروتئین برای حجم می‌گردید؟ پیشنهاد ما استفاده از پودر وی پروتئین ایزوله 100 درصد استلا نوتریشن است. این پودر از تخریب عضلات جلوگیری می‌کند و یکی از بهترین گزینه‌ها برای کمک به ریکاوری هرچه سریع‌تر است. به‌عنوان بهترین پروتئین وی برای حجم، این پودر را قبل و در حین ورزش مصرف کنید. استفاده از این مکمل منجر به افزایش توده عضلانی‌شده و اسیدهای آمینه مورد نیاز بدن را تامین می‌کند.',
        text5: 'بهترین پروتئین وی برای عضله‌سازی شما پودر پروتئین وی گلد رانتک است. این پودر علاوه بر بهبود رشد عضلات، از کوفتگی بعد از ورزش جلوگیری می‌کند و ریکاوری را سرعت می‌بخشد. با کمترین میزان چربی و کربوهیدرات، باید دو ساعت قبل و بعد از تمرین از این پودر استفاده کرد. حداکثر مقدار مجاز برای مصرف در روز 2 پیمانه است. پروتئین این مکمل از نوع کنسانتره است که به عضلات شما کمک می‌کند تا بهترین شکل ممکن رشد کنند.',
        text6: 'بهترین پروتئین وی ایزوله خارجی، با کیفیت بالا، کمترین مقدار چربی و کربوهیدرات و طعم بی‌نظیر، برای عضلات با ارزش بیولوژیکی بالا و کاهش چربی بدن مناسب است. محصولاتی همچون Isopure Zero Carb، ISO100 Hydrolyzed Whey Protein Isolate، و Gold Standard 100% Isolate از مارک‌های معتبر مانند Natures Best، Dymatize، و Optimum Nutrition، به‌عنوان بهترین‌های بازار شناخته می‌شوند.',
        text6: 'انتخاب بهترین پروتئین وی ایزوله خارجی برای بانوان به نیازها و ترجیحات فردی آنها بستگی دارد. بااین‌حال، برخی از محصولات محبوب و با رتبه‌بندی بالا در زیر ذکر شده است:'
    },
    {
        id: 2,
        src1: './src/assets/img/art4.jpeg',
        src2: './src/assets/img/pp2.jpeg',
        title: 'آیا پودر پروتئین باعث چاقی می شود؟',
        title2: 'تأثیر پودر پروتئین بر بدن',
        title3: 'افزایش رشد عضلات',
        title4: 'کاهش آسیب عضلانی',
        title5: 'حفظ توده عضلانی',
        title6: 'تأمین پروتئین مورد نیاز بدن',
        text1: 'طی سال‌های گذشته علاقه به حفظ تناسب اندام و سلامت جسمانی در جوامع مدرن، باعث افزایش توجه به اصول تغذیه صحیح و مصرف مکمل ورزشی شده است. یکی از مکمل‌های محبوب بین ورزشکاران، انواع پودرهای پروتئینی بوده و از جمله ادعاهایی که در این زمینه مطرح شده این است که مصرف پودر پروتئین می‌تواند باعث چاقی شود. در این مقاله از سایت داروخانه صبا، به بررسی این ادعا می‌پردازیم و تأثیر پودر پروتئین برای چاقی را مورد بررسی قرار می‌دهیم. لطفاً تا پایان با ما همراه باشید و نظرات خود را با ما و سایر مخاطبین به اشتراک بگذارید.',
        text2: 'پودر پروتئین یک مکمل محبوب بین ورزشکاران و افرادی است که به تقویت عضلات و بهبود سلامت عمومی بدن خود علاقه‌مند هستند. این محصول که به صورت پودری عرضه شده و معمولاً از منابع مختلف مانند سویا، شیر، آب پنیر و … تهیه می‌شود، حاوی پروتئین‌های مختلف است و نقش مهمی در تقویت عضلات بدن انسان دارد. در ادامه به بررسی برخی از تأثیرات پودر پروتئین برای چاقی و بدن انسان می‌پردازیم:',
        text3: 'پودر پروتئین، به دلیل برخورداری از پروتئین‌های باکیفیت، می‌تواند موجب افزایش حجم و تقویت عضلات شود. این پودر زمانی که بعد از تمرینات ورزشی مصرف ‌شود، به عضلات کمک می‌کند تا سریع‌تر بازسازی شده و بهبود یابند. این موضوع می‌تواند کارایی تمرینات ورزشی را افزایش داده و عملکرد ورزشکاران را بهبود بخشد. همچنین میتوانید با مراجعه به مقاله بهترین مکمل‌های ورزشی برای افزایش وزن و حجم دهی اطلاعات جامع‌تری کسب کنید.',
        text4: 'مصرف پودر پروتئین پس از تمرینات ورزشی، می‌تواند به کاهش آسیب‌های عضلانی کمک کند. این محصول می‌تواند فرآیند بازسازی عضلات را تسریع و از آسیب‌های ناشی از تمرینات پرفشار جلوگیری کند.',
        text5: 'پودر پروتئین می‌تواند در حفظ توده عضلانی بدن موثر باشد. ورزشکاران و افرادی که در رژیم‌های کاهش وزن هستند، ممکن است در معرض از دست دادن توده عضلانی باشند. با مصرف منظم پروتئین، می‌توان از کاهش توده عضلانی در رژیم‌های سنگین جلوگیری و وضعیت بدن را به خوبی حفظ کرد.',
        text6: 'مصرف پودر پروتئین می‌تواند به تأمین پروتئین‌های مورد نیاز بدن کمک کند. برخی از افراد ممکن است به دلیل شرایط خاص مانند بیماری‌ یا رژیم‌های غذایی محدود، نیاز به مقدار بیشتری پروتئین داشته باشند. مصرف پودر پروتئین در این موارد می‌تواند به عنوان یک منبع غذایی مفید عمل کند.'
    },

]


function Article_sub() {
    const { id } = useParams();
    const initialID =id.slice(1);
    console.log('in id', id);

    const article = artSub.find(item => item.id == initialID);
    console.log(article);

    if (!article) {
        return <div>مقاله پیدا نشد</div>;
    }

    return (
        <div className='article_sub'>
            {article.title && <h1>{article.title}</h1>}
            {article.src1 && <img src={`/${article.src1}`} alt={article.title} />}
            {article.text1 && <p>{article.text1}</p>}

            {article.title2 && <h2>{article.title2}</h2>}
            {article.text2 && <p>{article.text2}</p>}

            {article.title3 && <h2>{article.title3}</h2>}
            {article.text3 && <p>{article.text3}</p>}

            {article.title4 && <h2>{article.title4}</h2>}
            {article.text4 && <p>{article.text4}</p>}
            {article.src2 && <img src={`/${article.src2}`} alt={article.title4} />}

            {article.title5 && <h2>{article.title5}</h2>}
            {article.text5 && <p>{article.text5}</p>}

            {article.title6 && <h2>{article.title6}</h2>}
            {article.text6 && <p>{article.text6}</p>}
        </div>
    );
}

export default Article_sub;
