import '../assets/css/article.css'
import { Link } from 'react-router-dom';


function Article() {

    const articles = [
        {
            id: 6,
            title: 'تفاوت پروتئین وی ایزوله و کنسانتره در چیست؟',
            caption: 'اگر جزو علاقه‌مندان به بدنسازی باشید و به طور جدی این رشته ورزشی را دنبال کنید، حتماً می‌دانید که مصرف مقادیر مشخصی از پروتئین برای عضله‌سازی ضروری است. مصرف پروتئین نه تنها می‌تواند ',
            src: './src/assets/img/art6.jpeg'
        },
        {
            id: 5,
            title: 'بهترین برندهای کرم ضد آفتاب',
            caption: 'آیا بدون استفاده از ضد آفتاب می‌توان پوستی صاف، شفاف و بدون کک و مک داشت؟ پاسخ این سوال قطعاً منفی است. اگر می‌خواهید از خود در برابر سرطان پوست محافظت کنید و پوستی صاف و شفاف داشته ',
            src: './src/assets/img/art5.jpeg'
        },
        {
            id: 2,
            title: 'آیا پودر پروتئین باعث چاقی می شود؟',
            caption: 'طی سال‌های گذشته علاقه به حفظ تناسب اندام و سلامت جسمانی در جوامع مدرن، باعث افزایش توجه ',
            src: './src/assets/img/art4.jpeg'
        },
        {
            id: 3,
            title: 'بهترین مکمل های گینر برای افزایش وزن',
            caption: 'آیا شما هم جزو آن دسته از افرادی هستید که از تلاش دائم برای رسیدن به وزن ایده‌آل خود و نرسیدن به آن خسته شده‌اید؟ هر رژیم غذایی، ورزش و سایر روش‌های خارق‌العاده را امتحان کرده‌اید اما ',
            src: './src/assets/img/art3.jpeg'
        },
        {
            id: 4,
            title: 'آمینو چیست و چه تاثیری در بدنسازی دارد؟',
            caption: 'آمینو اسید از اجزای اساسی و مهم در ساختار بدن انسان و حیوانات است. این اسیدها به عنوان سازنده‌های اصلی پروتئین‌ها عمل می‌کنند که سلول‌ها و بافت‌های بدن را تشکیل می‌دهند. در علم تغذیه و ',
            src: './src/assets/img/art2.jpeg'
        },
        {
            id: 1,
            title: 'آیا پروتئین وی باعث ریزش مو می‌شود',
            caption: 'پروتئین وی یک مکمل ورزشی است که بسیاری از ورزشکاران برای رشد و ریکاوری عضلات استفاده می‌کنند. با این‌حال، مواردی از تاثیر پروتئین وی در ریزش مو گزارش شده است.',
            src: './src/assets/img/art1.jpeg'
        },
    
    ]

    return (
        <>
            <div className='article-cont'>
                {articles.map(art => (
                    <Artic art={art} />
                ))}
            </div>
        </>
    )
}

function Artic({ art }) {
    return (
        <>
            <Link to={`article/:${art.id}`} className='artic'>
                <img src={`${art.src}`} />
                <h2>{art.title}</h2>
                <p>{art.caption}</p>
            </Link>
        </>
    )
}

export default Article
